DROP TABLE if exists customers, suppliers, medicines, manufacturer, orders, storages, supply, supplylist, orderlist CASCADE ;

-- 1 дать право заказчикам смотреть данные о заказах которые они заказывали
-- пользователь клиент(заказчик) в бд

-- 2 дать право админу(нового пользователя) считать первые 10 записей из таблицы состав поставки с 8:00 12:00 утра

-- 3 дать право оператору изменять стоимость на меньшую и препаратов если срок годности выходит через 2 месяца

-- 4 дать право опреатору добавлять лекарства с проверкой что лекарство с БОЛЬШОЙ БУКВЫ

-- 5 дать право админу создавать процедуры
